{"($_Todoroki_Enji)": ["If the uniform was of any indication, Yagi ($_Yagi_Toshinori) had gone up against someone with a fire quirk. 20 bucks says it was that hot-headed Todoroki ($_Todoroki_Enji) the girls in general studies kept raving about."], "($_Akiyama)": ["He ($_Aizawa_Shouta) recalled Akiyama-senpai’s ($_Akiyama) suggestion to look into acquiring some sort of weapon after transfering into the hero department. Hopefully he’d ($_Aizawa_Shouta) get that chance soon."], "($_Yamada_Hizashi)": ["Hizashi ($_Yamada_Hizashi) laid on his ($_Yamada_Hizashi) back as he ($_Yamada_Hizashi) watched the clouds roll over Musutafu. His ($_Yamada_Hizashi) voice was gone, as well as what was left of his ($_Yamada_Hizashi) pride."], "($_Gigawatt)": ["“Might we have a hidden genius among our ranks? I sure hope so, since the little guy hasn’t put up much of a show so far,” Gigawatt ($_Gigawatt) relented. “Once more, from the General Studies department, Aizawa Shouta!”"], "($_Aizawa_Shouta)": ["He ($_Aizawa_Shouta) recalled Akiyama-senpai’s ($_Akiyama) suggestion to look into acquiring some sort of weapon after transfering into the hero department. Hopefully he’d ($_Aizawa_Shouta) get that chance soon.", "“As much as I love the occasional beatings Torino-sensei has begrudgingly offered to give me these past few weeks,” Shouta ($_Aizawa_Shouta) continued, “I don’t know how well I’ll do this high-pressure-entertainment-combat thing a second time around. Any information you can give about my opponent?”", "Shouta ($_Aizawa_Shouta) was certain the media would love Yagi ($_Yagi_Toshinori). Let’s just hope it doesn’t get to his ($_Yagi_Toshinori) head.", "They sat together and talked strategy for a few minutes before Shouta ($_Aizawa_Shouta) was called up to start heading out to the stage. He ($_Aizawa_Shouta) awkwardly nodded goodbye and left.", "Shouta ($_Aizawa_Shouta) worked on trying to steady his ($_Aizawa_Shouta) breathing as he ($_Aizawa_Shouta) walked down the stadium halls.", "Shouta_Aizawa ($_Aizawa_Shouta) was shaking and ready to puke, mentally kicking himself ($_Aizawa_Shouta) for his ($_Aizawa_Shouta) irrational anxiety.", "Shouta ($_Aizawa_Shouta) jumped when he ($_Aizawa_Shouta) heard a knock on the door. Would it kill people to leave him ($_Aizawa_Shouta) alone for once?", "He ($_Aizawa_Shouta) was sitting alone as he ($_Aizawa_Shouta) tried prepare himself ($_Aizawa_Shouta) for his ($_Aizawa_Shouta) next match. Keyword being tried . He’d ($_Aizawa_Shouta) taken a peek at the current rankings and he ($_Aizawa_Shouta) was guaranteed to go up against a hero department kid for the second round no matter who it was that won the current bracket.", "“Come in,” he ($_Aizawa_Shouta) said regardless, voice uneven.", "Shouta ($_Aizawa_Shouta) bit his ($_Aizawa_Shouta) lip. “I’m-”", "“I’ll admit that I’m a bit nervous, but I’ll figure something out,” he ($_Aizawa_Shouta) said. Analysis and quick-thinking had always been his ($_Aizawa_Shouta) strong points after all.", "Was he ($_Aizawa_Shouta) even ready? He’d ($_Aizawa_Shouta) have to go up regardless of how prepared he ($_Aizawa_Shouta) felt. His ($_Aizawa_Shouta) entire future depended on putting up another good fight, and if he ($_Aizawa_Shouta) so much as thought about backing down now then he ($_Aizawa_Shouta) might as well call it quits on being a hero entirely. There was a lot more than just a medal on the line. Winning held the power to open doors that had been closed in his ($_Aizawa_Shouta) face for years. Losing meant he’d ($_Aizawa_Shouta) be shoved to the sidelines once more, cursed to stare at the backs of his ($_Aizawa_Shouta) peers as they walked ahead of him ($_Aizawa_Shouta) towards the future. His ($_Aizawa_Shouta) situation was infuriating, to say the least.", "Shouta ($_Aizawa_Shouta) smirked.", "Shouta ($_Aizawa_Shouta) didn’t understand how the_blonde ($_Yagi_Toshinori) could smile through just about anything. It was almost as if smiling was his ($_Yagi_Toshinori) second quirk in addition to that destructive force of nature he ($_Yagi_Toshinori) dared shrug off as “a simple augmentation quirk”.", "Yagi ($_Yagi_Toshinori) walked over and patted him ($_Aizawa_Shouta) on the back. “That’s the spirit! I’m sure you’ll do fine.”", " His ($_Yagi_Toshinori) optimism wasn’t quite something to be admired either. Yagi ($_Yagi_Toshinori) tended to think the best of everyone, friend or otherwise, without a second thought. He ($_Yagi_Toshinori) was like a puppy. As nice as it may seem to be able to live life wearing rose-tinted glasses it was going to get Yagi ($_Yagi_Toshinori) into some serious trouble one day, mark his ($_Aizawa_Shouta) words. But Shouta ($_Aizawa_Shouta) supposed there’s not much that can be done to change something so deeply ingrained in someone’s nature.", "‘Simple’ my ass, Shouta ($_Aizawa_Shouta) thought. He’d ($_Aizawa_Shouta) seen Yagi ($_Yagi_Toshinori) spar a few times and that_kid ($_Yagi_Toshinori) threw punches hard enough to knock down a tree. Without even touching it. Honestly, Yagi ($_Yagi_Toshinori) was modest to a fault.", "“How did your fight go?” Shouta ($_Aizawa_Shouta) asked, pushing the topic of conversation away from himself ($_Aizawa_Shouta).", "There is something seriously wrong with this_guy ($_Yagi_Toshinori), Shouta ($_Aizawa_Shouta) thought. “Please elaborate, I don’t see how utter defeat is something to be happy about.”", "Shouta ($_Aizawa_Shouta) rolled his ($_Aizawa_Shouta) eyes.  “If survival is enough to make you happy then you seem to have very low expectations,” he ($_Aizawa_Shouta) said drily.", "Shouta ($_Aizawa_Shouta) stood in front of the entrance gate and waited for his ($_Aizawa_Shouta) name to be announced.", "He ($_Aizawa_Shouta) could do this. He ($_Aizawa_Shouta) had the advantage here, since he’d ($_Aizawa_Shouta) purposefully avoided drawing attention to his ($_Aizawa_Shouta) quirk up until this point. He’d ($_Aizawa_Shouta) survived the obstacle race and capture-the-flag with nothing but reflexes and logic, and as far as the audience knew he ($_Aizawa_Shouta) and his ($_Aizawa_Shouta) previous opponent had fought without quirks just for the hell of it. Of course, that wasn’t exactly the case but no one else needed to know that. He ($_Aizawa_Shouta) had the element of surprise on his ($_Aizawa_Shouta) side. He ($_Aizawa_Shouta) could do this. He ($_Aizawa_Shouta) could win.", "I’ll make sure to change that in a few minutes, he ($_Aizawa_Shouta) thought.", "The crowd didn’t give him ($_Aizawa_Shouta) much of a greeting, his ($_Aizawa_Shouta) presence so far in the festival being little more than that of a shadow’s.", "Shouta ($_Aizawa_Shouta) took one last deep breath before going out into the arena."], "($_Yagi_Toshinori)": ["Yagi ($_Yagi_Toshinori) hummed. “I think Hizashi and Rikuto just finished their fight, actually. Well, regardless of who ended up winning I might still be able to give you a few pointers,” he ($_Yagi_Toshinori) said.", "All Yagi ($_Yagi_Toshinori) did in response was offer a laugh.", "Shouta ($_Aizawa_Shouta) was certain the media would love Yagi ($_Yagi_Toshinori). Let’s just hope it doesn’t get to his ($_Yagi_Toshinori) head.", "“Do you have a strategy for your next match?” Yagi ($_Yagi_Toshinori) asked, suddenly remembering why they were in the waiting room again in the first place.", "“Ready Aizawa?” Yagi ($_Yagi_Toshinori) asked. He ($_Yagi_Toshinori) stepped inside to reveal a scorched uniform, fire having eaten away at most of the blue fabric. There was ash on his ($_Yagi_Toshinori) face and the ends of his ($_Yagi_Toshinori) hair were a little singed as well. Seems his ($_Yagi_Toshinori) opponent didn’t bother holding back.", "Shouta ($_Aizawa_Shouta) didn’t understand how the_blonde ($_Yagi_Toshinori) could smile through just about anything. It was almost as if smiling was his ($_Yagi_Toshinori) second quirk in addition to that destructive force of nature he ($_Yagi_Toshinori) dared shrug off as “a simple augmentation quirk”.", "Yagi ($_Yagi_Toshinori) walked over and patted him ($_Aizawa_Shouta) on the back. “That’s the spirit! I’m sure you’ll do fine.”", " His ($_Yagi_Toshinori) optimism wasn’t quite something to be admired either. Yagi ($_Yagi_Toshinori) tended to think the best of everyone, friend or otherwise, without a second thought. He ($_Yagi_Toshinori) was like a puppy. As nice as it may seem to be able to live life wearing rose-tinted glasses it was going to get Yagi ($_Yagi_Toshinori) into some serious trouble one day, mark his ($_Aizawa_Shouta) words. But Shouta ($_Aizawa_Shouta) supposed there’s not much that can be done to change something so deeply ingrained in someone’s nature.", "‘Simple’ my ass, Shouta ($_Aizawa_Shouta) thought. He’d ($_Aizawa_Shouta) seen Yagi ($_Yagi_Toshinori) spar a few times and that_kid ($_Yagi_Toshinori) threw punches hard enough to knock down a tree. Without even touching it. Honestly, Yagi ($_Yagi_Toshinori) was modest to a fault.", "If the uniform was of any indication, Yagi ($_Yagi_Toshinori) had gone up against someone with a fire quirk. 20 bucks says it was that hot-headed Todoroki ($_Todoroki_Enji) the girls in general studies kept raving about.", "There is something seriously wrong with this_guy ($_Yagi_Toshinori), Shouta ($_Aizawa_Shouta) thought. “Please elaborate, I don’t see how utter defeat is something to be happy about.”", "“I lost miserably,” Yagi ($_Yagi_Toshinori) said, smile unwavering.", "“You’re very right Aizawa, but I’m not smiling because I’m happy,” he ($_Yagi_Toshinori) said. “I’m smiling because I’m still alive to try to beat him next year.”"]}